# Data Science Jobs Salaries

In [82]:
import pandas as pd

In [83]:
data = pd.read_csv("../Tugas/jobs_salaries.csv") #membuka data

In [84]:
data.head() #menampilkan data 5 pertama

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021e,EN,FT,Data Science Consultant,54000,EUR,64369,DE,50,DE,L
1,2020,SE,FT,Data Scientist,60000,EUR,68428,GR,100,US,L
2,2021e,EX,FT,Head of Data Science,85000,USD,85000,RU,0,RU,M
3,2021e,EX,FT,Head of Data,230000,USD,230000,RU,50,RU,L
4,2021e,EN,FT,Machine Learning Engineer,125000,USD,125000,US,100,US,S

In [85]:
data.describe() #statistika deskriptif data

             salary  salary_in_usd  remote_ratio
count  2.450000e+02     245.000000    245.000000
mean   5.025418e+05   99868.012245     69.183673
std    2.276230e+06   83983.326949     37.593421
min    4.000000e+03    2876.000000      0.000000
25%    6.000000e+04   45896.000000     50.000000
50%    1.030000e+05   81000.000000    100.000000
75%    1.740000e+05  130000.000000    100.000000
max    3.040000e+07  600000.000000    100.000000

In [86]:
data.describe(include=object) #deskripsi data yang kategorinya object

,work_year,experience_level,employment_type,job_title,salary_currency,employee_residence,company_location,company_size
count,245,245,245,245,245,245,245,245
unique,2,4,4,43,15,45,41,3
top,2021e,MI,FT,Data Scientist,USD,US,US,L
freq,179,103,231,59,126,92,108,132

In [87]:
data.info

<bound method DataFrame.info of     work_year experience_level employment_type                  job_title  \
0       2021e               EN              FT    Data Science Consultant
1        2020               SE              FT             Data Scientist
2       2021e               EX              FT       Head of Data Science
3       2021e               EX              FT               Head of Data
4       2021e               EN              FT  Machine Learning Engineer
..        ...              ...             ...                        ...
240      2020               SE              FT             Data Scientist
241     2021e               MI              FT   Principal Data Scientist
242      2020               EN              FT             Data Scientist
243      2020               EN              CT      Business Data Analyst
244     2021e               SE              FT       Data Science Manager

      salary salary_currency  salary_in_usd employee_residence  remote_ratio  \
0      54000             EUR          64369                 DE            50
1      60000             EUR          68428                 GR           100
2      85000             USD          85000                 RU             0
3     230000             USD         230000                 RU            50
4     125000             USD         125000                 US           100
..       ...             ...            ...                ...           ...
240   412000             USD         412000                 US           100
241   151000             USD         151000                 US           100
242   105000             USD         105000                 US           100
243   100000             USD         100000                 US           100
244  7000000             INR          94917                 IN            50

    company_location company_size
0                 DE            L
1                 US            L
2                 RU            M
3                 RU            L
4                 US            S
..               ...          ...
240               US            L
241               US            L
242               US            S
243               US            L
244               IN            L

[245 rows x 11 columns]>

In [88]:
data.isna().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [89]:
data_1 = data[['experience_level','salary_in_usd']]
data_1.head() #menampilkan data kolom experience level dan salary in usd 5 data pertama

  experience_level  salary_in_usd
0               EN          64369
1               SE          68428
2               EX          85000
3               EX         230000
4               EN         125000

In [90]:
data_1['experience_level'].value_counts() #menghitung banyaknya data pada kolom experience level

MI    103
SE     77
EN     54
EX     11
Name: experience_level, dtype: int64

In [91]:
grouped_en = data_1.groupby('experience_level') #menampilkan kolom experience leven EN (junior) dan gajinya
print (grouped_en.get_group('EN'))

    experience_level  salary_in_usd
0                 EN          64369
4                 EN         125000
11                EN          13400
17                EN          90000
18                EN          60000
20                EN          12000
28                EN          83000
29                EN         250000
30                EN          59601
32                EN          10000
33                EN         138000
37                EN          80000
44                EN         225000
45                EN          77481
51                EN          30509
60                EN          15966
62                EN          70000
66                EN          29831
74                EN          28475
76                EN          90000
78                EN           6072
83                EN          36952
85                EN          91000
90                EN          21695
91                EN          42000
103               EN          72500
106               EN         100000
111               EN          58000
112               EN         100000
114               EN          85000
115               EN          77481
117               EN          72000
118               EN          65561
129               EN          16271
133               EN          25032
136               EN           9272
141               EN          21844
143               EN          51321
148               EN          39916
154               EN          81000
157               EN          90000
169               EN          41689
172               EN           5707
174               EN          28850
187               EN          45896
194               EN           5898
197               EN          62726
199               EN          21669
213               EN          59601
218               EN           4000
219               EN          18102
225               EN          12000
242               EN         105000
243               EN         100000

In [92]:
en_experience = grouped_en.get_group('EN') #memberi nama variabel untuk

In [93]:
mean_en = en_experience['salary_in_usd'].mean()

In [94]:
grouped_mi = data_1.groupby('experience_level')
print (grouped_mi.get_group('MI'))

    experience_level  salary_in_usd
6                 MI         450000
7                 MI          46759
8                 MI          74130
12                MI          75966
13                MI         150000
..               ...            ...
233               MI         130800
236               MI         119353
237               MI         423000
238               MI          28608
241               MI         151000

[103 rows x 2 columns]

In [95]:
mi_experience = grouped_mi.get_group('MI')
mean_mi = mi_experience['salary_in_usd'].mean()

In [96]:
grouped_se = data_1.groupby('experience_level')
print (grouped_se.get_group('SE'))

    experience_level  salary_in_usd
1                 SE          68428
5                 SE         120000
9                 SE         127543
10                SE         144000
15                SE         153000
..               ...            ...
234               SE          45618
235               SE         168000
239               SE         165000
240               SE         412000
244               SE          94917

[77 rows x 2 columns]

In [97]:
se_experience = grouped_se.get_group('SE')
mean_se = se_experience['salary_in_usd'].mean()

In [98]:
grouped_ex = data_1.groupby('experience_level')
print (grouped_ex.get_group('EX'))

    experience_level  salary_in_usd
2                 EX          85000
3                 EX         230000
25                EX         154963
41                EX         235000
42                EX         150000
43                EX          79833
128               EX         143043
145               EX          70329
162               EX         416000
185               EX         325000
191               EX         600000

In [99]:
ex_experience = grouped_ex.get_group('EX')
mean_ex = ex_experience['salary_in_usd'].mean()

In [100]:
mean_experience = {'Experience Level':['junior','intermediate','expert','director'],'Rata-Rata Gaji': [mean_en, mean_ex, mean_mi, mean_se]}
pd.DataFrame(mean_experience)

  Experience Level  Rata-Rata Gaji
0           junior    59753.462963
1     intermediate   226288.000000
2           expert    85738.135922
3         director   128841.298701

## Employment Type

In [101]:
data_2 = data[['employment_type','salary_in_usd']]
data_2.head()

  employment_type  salary_in_usd
0              FT          64369
1              FT          68428
2              FT          85000
3              FT         230000
4              FT         125000

In [102]:
data_2['employment_type'].value_counts()

FT    231
PT      7
CT      4
FL      3
Name: employment_type, dtype: int64

In [103]:
grouped_ft = data_2.groupby('employment_type')
print (grouped_ft.get_group('FT'))

    employment_type  salary_in_usd
0                FT          64369
1                FT          68428
2                FT          85000
3                FT         230000
4                FT         125000
..              ...            ...
239              FT         165000
240              FT         412000
241              FT         151000
242              FT         105000
244              FT          94917

[231 rows x 2 columns]

In [104]:
grouped_pt = data_2.groupby('employment_type')
print (grouped_pt.get_group('PT'))

    employment_type  salary_in_usd
20               PT          12000
21               PT           5423
60               PT          15966
105              PT          70329
174              PT          28850
199              PT          21669
225              PT          12000

In [105]:
grouped_ct = data_2.groupby('employment_type')
print (grouped_ct.get_group('CT'))

    employment_type  salary_in_usd
22               CT         270000
116              CT         105000
162              CT         416000
243              CT         100000

In [106]:
grouped_fl = data_2.groupby('employment_type')
print (grouped_fl.get_group('FL'))

    employment_type  salary_in_usd
184              FL          20000
205              FL          12000
210              FL          60000

In [107]:
ft_type= grouped_ft.get_group('FT')
mean_ft = ft_type['salary_in_usd'].mean()

pt_type= grouped_pt.get_group('PT')
mean_pt = pt_type['salary_in_usd'].mean()

ct_type= grouped_ct.get_group('CT')
mean_ct = ct_type['salary_in_usd'].mean()

fl_type= grouped_fl.get_group('FL')
mean_fl = fl_type['salary_in_usd'].mean()

In [108]:
mean_employement_type = {'Tipe pegawai':['Full Time','Part Time','Contract','Freelance'],'Rata-Rata Gaji': [mean_ft, mean_pt, mean_ct, mean_fl]}
pd.DataFrame(mean_employement_type)

  Tipe pegawai  Rata-Rata Gaji
0    Full Time   100945.567100
1    Part Time    23748.142857
2     Contract   222750.000000
3    Freelance    30666.666667